# Условие задачи №3 (ESCAPE символы)

"""
Написать программу, которая выводит
в консоль таблицу Escape-последовательностей:
"""

esc = 'Escape sequences:\n\
\n\
\\a \t\tBell(alert)\n\
\\b \t\tBackspace\n\
\\n \t\tNew Line\n\
\\t \t\tHorizontal tab\n\
\\  \t\tBackslash \\\n\
\\" \t\tDoubel quotation mark "\n\
\\\'\t\tSingle quotation mark \''

print(esc)

# Выполнил задачу через экранизацию!
